{
  "storage" : "model.espresso.weights",
  "analyses" : {

  },
  "properties" : {

  },
  "format_version" : 200,
  "layers" : [
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "batch_normalization_1",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "activation_1_output",
      "K" : 4,
      "blob_biases" : 1,
      "name" : "batch_normalization_1",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 8,
      "bottom" : "input1",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1,
      "blob_weights_f16" : 3
    },
    {
      "pad_r" : 0,
      "debug_info" : "max_pooling2d_1",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "size_x" : 2,
      "top" : "max_pooling2d_1_output",
      "top_shape_style" : 0,
      "stride_x" : 2,
      "avg_or_max" : 1,
      "average_count_exclude_padding" : 1,
      "type" : "pool",
      "name" : "max_pooling2d_1",
      "pad_t" : 0,
      "stride_y" : 2,
      "bottom" : "activation_1_output",
      "weights" : {

      },
      "pad_mode" : 1,
      "size_y" : 2,
      "pad_value" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "conv2d_2",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "conv2d_2_output",
      "K" : 8,
      "blob_biases" : 5,
      "name" : "conv2d_2",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 16,
      "bottom" : "max_pooling2d_1_output",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1,
      "blob_weights_f16" : 7
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "batch_normalization_2_step_1",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "batch_normalization_2_output_intermin_",
      "K" : 8,
      "stride_x" : 2,
      "name" : "batch_normalization_2_step_1",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 8,
      "pad_t" : 0,
      "stride_y" : 2,
      "has_biases" : 0,
      "C" : 8,
      "bottom" : "activation_1_output",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1,
      "blob_weights_f16" : 9
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "batch_normalization_2_step_2",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "batch_normalization_2_output",
      "K" : 8,
      "blob_biases" : 11,
      "name" : "batch_normalization_2_step_2",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 16,
      "bottom" : "batch_normalization_2_output_intermin_",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1,
      "blob_weights_f16" : 13
    },
    {
      "bottom" : "conv2d_2_output,batch_normalization_2_output",
      "alpha" : 1,
      "operation" : 0,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "add_1",
      "top" : "add_1_output",
      "type" : "elementwise",
      "name" : "add_1",
      "beta" : 0
    },
    {
      "bottom" : "add_1_output",
      "weights" : {

      },
      "mode" : 0,
      "debug_info" : "activation_2",
      "top" : "activation_2_output",
      "type" : "activation",
      "name" : "activation_2"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "batch_normalization_3_step_1",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "batch_normalization_3_output_intermin_",
      "K" : 16,
      "name" : "batch_normalization_3_step_1",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 16,
      "pad_t" : 0,
      "has_biases" : 0,
      "C" : 16,
      "bottom" : "activation_2_output",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1,
      "blob_weights_f16" : 15
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "batch_normalization_3_step_2",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "batch_normalization_3_output",
      "K" : 16,
      "blob_biases" : 17,
      "name" : "batch_normalization_3_step_2",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 16,
      "bottom" : "batch_normalization_3_output_intermin_",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1,
      "blob_weights_f16" : 19
    },
    {
      "bottom" : "activation_2_output,batch_normalization_3_output",
      "alpha" : 1,
      "operation" : 0,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "add_2",
      "top" : "add_2_output",
      "type" : "elementwise",
      "name" : "add_2",
      "beta" : 0
    },
    {
      "bottom" : "add_2_output",
      "weights" : {

      },
      "mode" : 0,
      "debug_info" : "activation_3",
      "top" : "activation_3_output",
      "type" : "activation",
      "name" : "activation_3"
    },
    {
      "pad_r" : 0,
      "debug_info" : "max_pooling2d_2",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "size_x" : 2,
      "top" : "max_pooling2d_2_output",
      "top_shape_style" : 0,
      "stride_x" : 2,
      "avg_or_max" : 1,
      "average_count_exclude_padding" : 1,
      "type" : "pool",
      "name" : "max_pooling2d_2",
      "pad_t" : 0,
      "stride_y" : 2,
      "bottom" : "activation_3_output",
      "weights" : {

      },
      "pad_mode" : 1,
      "size_y" : 2,
      "pad_value" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "conv2d_3",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "conv2d_3_output",
      "K" : 16,
      "blob_biases" : 21,
      "name" : "conv2d_3",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 32,
      "bottom" : "max_pooling2d_2_output",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1,
      "blob_weights_f16" : 23
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "batch_normalization_4_step_1",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "batch_normalization_4_output_intermin_",
      "K" : 16,
      "stride_x" : 2,
      "name" : "batch_normalization_4_step_1",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 16,
      "pad_t" : 0,
      "stride_y" : 2,
      "has_biases" : 0,
      "C" : 16,
      "bottom" : "activation_3_output",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1,
      "blob_weights_f16" : 25
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "batch_normalization_4_step_2",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "batch_normalization_4_output",
      "K" : 16,
      "blob_biases" : 27,
      "name" : "batch_normalization_4_step_2",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 32,
      "bottom" : "batch_normalization_4_output_intermin_",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1,
      "blob_weights_f16" : 29
    },
    {
      "bottom" : "conv2d_3_output,batch_normalization_4_output",
      "alpha" : 1,
      "operation" : 0,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "add_3",
      "top" : "add_3_output",
      "type" : "elementwise",
      "name" : "add_3",
      "beta" : 0
    },
    {
      "bottom" : "add_3_output",
      "weights" : {

      },
      "mode" : 0,
      "debug_info" : "activation_4",
      "top" : "activation_4_output",
      "type" : "activation",
      "name" : "activation_4"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "batch_normalization_5_step_1",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "batch_normalization_5_output_intermin_",
      "K" : 32,
      "name" : "batch_normalization_5_step_1",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 32,
      "pad_t" : 0,
      "has_biases" : 0,
      "C" : 32,
      "bottom" : "activation_4_output",
      "weights" : {

      },
      "Nx" : 5,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 5,
      "n_parallel" : 1,
      "blob_weights_f16" : 31
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "batch_normalization_5_step_2",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "batch_normalization_5_output",
      "K" : 32,
      "blob_biases" : 33,
      "name" : "batch_normalization_5_step_2",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 32,
      "bottom" : "batch_normalization_5_output_intermin_",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1,
      "blob_weights_f16" : 35
    },
    {
      "bottom" : "activation_4_output,batch_normalization_5_output",
      "alpha" : 1,
      "operation" : 0,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "add_4",
      "top" : "add_4_output",
      "type" : "elementwise",
      "name" : "add_4",
      "beta" : 0
    },
    {
      "bottom" : "add_4_output",
      "weights" : {

      },
      "mode" : 0,
      "debug_info" : "activation_5",
      "top" : "activation_5_output",
      "type" : "activation",
      "name" : "activation_5"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "batch_normalization_6_step_1",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "batch_normalization_6_output_intermin_",
      "K" : 32,
      "name" : "batch_normalization_6_step_1",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 32,
      "pad_t" : 0,
      "has_biases" : 0,
      "C" : 32,
      "bottom" : "activation_5_output",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1,
      "blob_weights_f16" : 37
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "batch_normalization_6_step_2",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "batch_normalization_6_output",
      "K" : 32,
      "blob_biases" : 39,
      "name" : "batch_normalization_6_step_2",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 32,
      "bottom" : "batch_normalization_6_output_intermin_",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1,
      "blob_weights_f16" : 41
    },
    {
      "bottom" : "activation_5_output,batch_normalization_6_output",
      "alpha" : 1,
      "operation" : 0,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "add_5",
      "top" : "add_5_output",
      "type" : "elementwise",
      "name" : "add_5",
      "beta" : 0
    },
    {
      "bottom" : "add_5_output",
      "weights" : {

      },
      "mode" : 0,
      "debug_info" : "activation_6",
      "top" : "activation_6_output",
      "type" : "activation",
      "name" : "activation_6"
    },
    {
      "pad_r" : 0,
      "debug_info" : "max_pooling2d_3",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "size_x" : 2,
      "top" : "max_pooling2d_3_output",
      "top_shape_style" : 0,
      "stride_x" : 2,
      "avg_or_max" : 1,
      "average_count_exclude_padding" : 1,
      "type" : "pool",
      "name" : "max_pooling2d_3",
      "pad_t" : 0,
      "stride_y" : 2,
      "bottom" : "activation_6_output",
      "weights" : {

      },
      "pad_mode" : 1,
      "size_y" : 2,
      "pad_value" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "conv2d_4",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "conv2d_4_output",
      "K" : 32,
      "blob_biases" : 43,
      "name" : "conv2d_4",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 64,
      "bottom" : "max_pooling2d_3_output",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1,
      "blob_weights_f16" : 45
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "batch_normalization_7_step_1",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "batch_normalization_7_output_intermin_",
      "K" : 32,
      "stride_x" : 2,
      "name" : "batch_normalization_7_step_1",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 32,
      "pad_t" : 0,
      "stride_y" : 2,
      "has_biases" : 0,
      "C" : 32,
      "bottom" : "activation_6_output",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1,
      "blob_weights_f16" : 47
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "batch_normalization_7_step_2",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "batch_normalization_7_output",
      "K" : 32,
      "blob_biases" : 49,
      "name" : "batch_normalization_7_step_2",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 64,
      "bottom" : "batch_normalization_7_output_intermin_",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1,
      "blob_weights_f16" : 51
    },
    {
      "bottom" : "conv2d_4_output,batch_normalization_7_output",
      "alpha" : 1,
      "operation" : 0,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "add_6",
      "top" : "add_6_output",
      "type" : "elementwise",
      "name" : "add_6",
      "beta" : 0
    },
    {
      "bottom" : "add_6_output",
      "weights" : {

      },
      "mode" : 0,
      "debug_info" : "activation_7",
      "top" : "activation_7_output",
      "type" : "activation",
      "name" : "activation_7"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "batch_normalization_8_step_1",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "batch_normalization_8_output_intermin_",
      "K" : 64,
      "name" : "batch_normalization_8_step_1",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 64,
      "pad_t" : 0,
      "has_biases" : 0,
      "C" : 64,
      "bottom" : "activation_7_output",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1,
      "blob_weights_f16" : 53
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "batch_normalization_8_step_2",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "batch_normalization_8_output",
      "K" : 64,
      "blob_biases" : 55,
      "name" : "batch_normalization_8_step_2",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 64,
      "bottom" : "batch_normalization_8_output_intermin_",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1,
      "blob_weights_f16" : 57
    },
    {
      "bottom" : "activation_7_output,batch_normalization_8_output",
      "alpha" : 1,
      "operation" : 0,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "add_7",
      "top" : "add_7_output",
      "type" : "elementwise",
      "name" : "add_7",
      "beta" : 0
    },
    {
      "bottom" : "add_7_output",
      "weights" : {

      },
      "mode" : 0,
      "debug_info" : "activation_8",
      "top" : "activation_8_output",
      "type" : "activation",
      "name" : "activation_8"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "batch_normalization_9_step_1",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "batch_normalization_9_output_intermin_",
      "K" : 64,
      "name" : "batch_normalization_9_step_1",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 64,
      "pad_t" : 0,
      "has_biases" : 0,
      "C" : 64,
      "bottom" : "activation_8_output",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1,
      "blob_weights_f16" : 59
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "batch_normalization_9_step_2",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "batch_normalization_9_output",
      "K" : 64,
      "blob_biases" : 61,
      "name" : "batch_normalization_9_step_2",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 64,
      "bottom" : "batch_normalization_9_output_intermin_",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1,
      "blob_weights_f16" : 63
    },
    {
      "bottom" : "activation_8_output,batch_normalization_9_output",
      "alpha" : 1,
      "operation" : 0,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "add_8",
      "top" : "add_8_output",
      "type" : "elementwise",
      "name" : "add_8",
      "beta" : 0
    },
    {
      "bottom" : "add_8_output",
      "weights" : {

      },
      "mode" : 0,
      "debug_info" : "activation_9",
      "top" : "activation_9_output",
      "type" : "activation",
      "name" : "activation_9"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "batch_normalization_10_step_1",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "batch_normalization_10_output_intermin_",
      "K" : 64,
      "name" : "batch_normalization_10_step_1",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 64,
      "pad_t" : 0,
      "has_biases" : 0,
      "C" : 64,
      "bottom" : "activation_9_output",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1,
      "blob_weights_f16" : 65
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "batch_normalization_10_step_2",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "batch_normalization_10_output",
      "K" : 64,
      "blob_biases" : 67,
      "name" : "batch_normalization_10_step_2",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 64,
      "bottom" : "batch_normalization_10_output_intermin_",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1,
      "blob_weights_f16" : 69
    },
    {
      "bottom" : "activation_9_output,batch_normalization_10_output",
      "alpha" : 1,
      "operation" : 0,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "add_9",
      "top" : "add_9_output",
      "type" : "elementwise",
      "name" : "add_9",
      "beta" : 0
    },
    {
      "bottom" : "add_9_output",
      "weights" : {

      },
      "mode" : 0,
      "debug_info" : "activation_10",
      "top" : "activation_10_output",
      "type" : "activation",
      "name" : "activation_10"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "batch_normalization_11_step_1",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "batch_normalization_11_output_intermin_",
      "K" : 64,
      "name" : "batch_normalization_11_step_1",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 64,
      "pad_t" : 0,
      "has_biases" : 0,
      "C" : 64,
      "bottom" : "activation_10_output",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1,
      "blob_weights_f16" : 71
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "batch_normalization_11_step_2",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "batch_normalization_11_output",
      "K" : 64,
      "blob_biases" : 73,
      "name" : "batch_normalization_11_step_2",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 64,
      "bottom" : "batch_normalization_11_output_intermin_",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1,
      "blob_weights_f16" : 75
    },
    {
      "bottom" : "activation_10_output,batch_normalization_11_output",
      "alpha" : 1,
      "operation" : 0,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "add_10",
      "top" : "add_10_output",
      "type" : "elementwise",
      "name" : "add_10",
      "beta" : 0
    },
    {
      "bottom" : "add_10_output",
      "weights" : {

      },
      "mode" : 0,
      "debug_info" : "activation_11",
      "top" : "activation_11_output",
      "type" : "activation",
      "name" : "activation_11"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "batch_normalization_12_step_1",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "batch_normalization_12_output_intermin_",
      "K" : 64,
      "name" : "batch_normalization_12_step_1",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 64,
      "pad_t" : 0,
      "has_biases" : 0,
      "C" : 64,
      "bottom" : "activation_11_output",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1,
      "blob_weights_f16" : 77
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "batch_normalization_12_step_2",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "activation_12_output",
      "K" : 64,
      "blob_biases" : 79,
      "name" : "batch_normalization_12_step_2",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 32,
      "bottom" : "batch_normalization_12_output_intermin_",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1,
      "blob_weights_f16" : 81
    },
    {
      "top" : "up_sampling2d_1_output",
      "use_fractional_scale_factors" : false,
      "weights" : {

      },
      "fractional_scaling_factor_y" : 1,
      "type" : "upsample",
      "scaling_factor_x" : 2,
      "mode" : 1,
      "align_corners" : 0,
      "bottom" : "activation_12_output",
      "debug_info" : "up_sampling2d_1",
      "fractional_scaling_factor_x" : 1,
      "is_legacy_mode" : 1,
      "name" : "up_sampling2d_1",
      "scaling_factor_y" : 2
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "batch_normalization_13",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "batch_normalization_13_output",
      "K" : 32,
      "blob_biases" : 83,
      "name" : "batch_normalization_13",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 32,
      "bottom" : "activation_6_output",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1,
      "blob_weights_f16" : 85
    },
    {
      "bottom" : "up_sampling2d_1_output,batch_normalization_13_output",
      "alpha" : 1,
      "operation" : 0,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "add_11",
      "top" : "add_11_output",
      "type" : "elementwise",
      "name" : "add_11",
      "beta" : 0
    },
    {
      "bottom" : "add_11_output",
      "weights" : {

      },
      "mode" : 0,
      "debug_info" : "activation_13",
      "top" : "activation_13_output",
      "type" : "activation",
      "name" : "activation_13"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "separable_conv2d_12_step_1",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "separable_conv2d_12_output_intermin_",
      "K" : 32,
      "name" : "separable_conv2d_12_step_1",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 32,
      "pad_t" : 0,
      "has_biases" : 0,
      "C" : 32,
      "bottom" : "activation_13_output",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1,
      "blob_weights_f16" : 87
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "separable_conv2d_12_step_2",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "activation_14_output",
      "K" : 32,
      "blob_biases" : 89,
      "name" : "separable_conv2d_12_step_2",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 32,
      "bottom" : "separable_conv2d_12_output_intermin_",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1,
      "blob_weights_f16" : 91
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "batch_normalization_14_step_1",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "batch_normalization_14_output_intermin_",
      "K" : 32,
      "name" : "batch_normalization_14_step_1",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 32,
      "pad_t" : 0,
      "has_biases" : 0,
      "C" : 32,
      "bottom" : "activation_14_output",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1,
      "blob_weights_f16" : 93
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "batch_normalization_14_step_2",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "batch_normalization_14_output",
      "K" : 32,
      "blob_biases" : 95,
      "name" : "batch_normalization_14_step_2",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 32,
      "bottom" : "batch_normalization_14_output_intermin_",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1,
      "blob_weights_f16" : 97
    },
    {
      "bottom" : "activation_14_output,batch_normalization_14_output",
      "alpha" : 1,
      "operation" : 0,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "add_12",
      "top" : "add_12_output",
      "type" : "elementwise",
      "name" : "add_12",
      "beta" : 0
    },
    {
      "bottom" : "add_12_output",
      "weights" : {

      },
      "mode" : 0,
      "debug_info" : "activation_15",
      "top" : "activation_15_output",
      "type" : "activation",
      "name" : "activation_15"
    },
    {
      "top" : "up_sampling2d_2_output",
      "use_fractional_scale_factors" : false,
      "weights" : {

      },
      "fractional_scaling_factor_y" : 1,
      "type" : "upsample",
      "scaling_factor_x" : 2,
      "mode" : 1,
      "align_corners" : 0,
      "bottom" : "activation_15_output",
      "debug_info" : "up_sampling2d_2",
      "fractional_scaling_factor_x" : 1,
      "is_legacy_mode" : 1,
      "name" : "up_sampling2d_2",
      "scaling_factor_y" : 2
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "batch_normalization_15",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "batch_normalization_15_output",
      "K" : 16,
      "blob_biases" : 99,
      "name" : "batch_normalization_15",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 32,
      "bottom" : "activation_3_output",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1,
      "blob_weights_f16" : 101
    },
    {
      "bottom" : "up_sampling2d_2_output,batch_normalization_15_output",
      "alpha" : 1,
      "operation" : 0,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "add_13",
      "top" : "add_13_output",
      "type" : "elementwise",
      "name" : "add_13",
      "beta" : 0
    },
    {
      "bottom" : "add_13_output",
      "weights" : {

      },
      "mode" : 0,
      "debug_info" : "activation_16",
      "top" : "activation_16_output",
      "type" : "activation",
      "name" : "activation_16"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "separable_conv2d_14_step_1",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "separable_conv2d_14_output_intermin_",
      "K" : 32,
      "name" : "separable_conv2d_14_step_1",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 32,
      "pad_t" : 0,
      "has_biases" : 0,
      "C" : 32,
      "bottom" : "activation_16_output",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1,
      "blob_weights_f16" : 103
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "separable_conv2d_14_step_2",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "activation_17_output",
      "K" : 32,
      "blob_biases" : 105,
      "name" : "separable_conv2d_14_step_2",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 16,
      "bottom" : "separable_conv2d_14_output_intermin_",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1,
      "blob_weights_f16" : 107
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "batch_normalization_16_step_1",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "batch_normalization_16_output_intermin_",
      "K" : 16,
      "name" : "batch_normalization_16_step_1",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 16,
      "pad_t" : 0,
      "has_biases" : 0,
      "C" : 16,
      "bottom" : "activation_17_output",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1,
      "blob_weights_f16" : 109
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "batch_normalization_16_step_2",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "activation_18_output",
      "K" : 16,
      "blob_biases" : 111,
      "name" : "batch_normalization_16_step_2",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 16,
      "bottom" : "batch_normalization_16_output_intermin_",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1,
      "blob_weights_f16" : 113
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "batch_normalization_17_step_1",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "batch_normalization_17_output_intermin_",
      "K" : 16,
      "name" : "batch_normalization_17_step_1",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 16,
      "pad_t" : 0,
      "has_biases" : 0,
      "C" : 16,
      "bottom" : "activation_18_output",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1,
      "blob_weights_f16" : 115
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "batch_normalization_17_step_2",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "batch_normalization_17_output",
      "K" : 16,
      "blob_biases" : 117,
      "name" : "batch_normalization_17_step_2",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 16,
      "bottom" : "batch_normalization_17_output_intermin_",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1,
      "blob_weights_f16" : 119
    },
    {
      "bottom" : "activation_17_output,batch_normalization_17_output",
      "alpha" : 1,
      "operation" : 0,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "add_14",
      "top" : "add_14_output",
      "type" : "elementwise",
      "name" : "add_14",
      "beta" : 0
    },
    {
      "bottom" : "add_14_output",
      "weights" : {

      },
      "mode" : 0,
      "debug_info" : "activation_19",
      "top" : "activation_19_output",
      "type" : "activation",
      "name" : "activation_19"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "separable_conv2d_17_step_1",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "separable_conv2d_17_output_intermin_",
      "K" : 16,
      "name" : "separable_conv2d_17_step_1",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 16,
      "pad_t" : 0,
      "has_biases" : 0,
      "C" : 16,
      "bottom" : "activation_19_output",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1,
      "blob_weights_f16" : 121
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "separable_conv2d_17_step_2",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "activation_20_output",
      "K" : 16,
      "blob_biases" : 123,
      "name" : "separable_conv2d_17_step_2",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 8,
      "bottom" : "separable_conv2d_17_output_intermin_",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1,
      "blob_weights_f16" : 125
    },
    {
      "top" : "up_sampling2d_3_output",
      "use_fractional_scale_factors" : false,
      "weights" : {

      },
      "fractional_scaling_factor_y" : 1,
      "type" : "upsample",
      "scaling_factor_x" : 2,
      "mode" : 1,
      "align_corners" : 0,
      "bottom" : "activation_20_output",
      "debug_info" : "up_sampling2d_3",
      "fractional_scaling_factor_x" : 1,
      "is_legacy_mode" : 1,
      "name" : "up_sampling2d_3",
      "scaling_factor_y" : 2
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "conv2d_7",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "conv2d_7_output",
      "K" : 8,
      "blob_biases" : 127,
      "name" : "conv2d_7",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 8,
      "bottom" : "activation_1_output",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1,
      "blob_weights_f16" : 129
    },
    {
      "bottom" : "up_sampling2d_3_output,conv2d_7_output",
      "alpha" : 1,
      "operation" : 0,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "add_15",
      "top" : "add_15_output",
      "type" : "elementwise",
      "name" : "add_15",
      "beta" : 0
    },
    {
      "bottom" : "add_15_output",
      "weights" : {

      },
      "mode" : 0,
      "debug_info" : "activation_21",
      "top" : "activation_21_output",
      "type" : "activation",
      "name" : "activation_21"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "separable_conv2d_18_step_1",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "separable_conv2d_18_output_intermin_",
      "K" : 8,
      "name" : "separable_conv2d_18_step_1",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 8,
      "pad_t" : 0,
      "has_biases" : 0,
      "C" : 8,
      "bottom" : "activation_21_output",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1,
      "blob_weights_f16" : 131
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "separable_conv2d_18_step_2",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "activation_22_output",
      "K" : 8,
      "blob_biases" : 133,
      "name" : "separable_conv2d_18_step_2",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 8,
      "bottom" : "separable_conv2d_18_output_intermin_",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1,
      "blob_weights_f16" : 135
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "batch_normalization_18_step_1",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "batch_normalization_18_output_intermin_",
      "K" : 8,
      "name" : "batch_normalization_18_step_1",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 8,
      "pad_t" : 0,
      "has_biases" : 0,
      "C" : 8,
      "bottom" : "activation_22_output",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1,
      "blob_weights_f16" : 137
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "batch_normalization_18_step_2",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "activation_23_output",
      "K" : 8,
      "blob_biases" : 139,
      "name" : "batch_normalization_18_step_2",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 8,
      "bottom" : "batch_normalization_18_output_intermin_",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1,
      "blob_weights_f16" : 141
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "batch_normalization_19_step_1",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "batch_normalization_19_output_intermin_",
      "K" : 8,
      "name" : "batch_normalization_19_step_1",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 8,
      "pad_t" : 0,
      "has_biases" : 0,
      "C" : 8,
      "bottom" : "activation_23_output",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1,
      "blob_weights_f16" : 143
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "batch_normalization_19_step_2",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "batch_normalization_19_output",
      "K" : 8,
      "blob_biases" : 145,
      "name" : "batch_normalization_19_step_2",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 8,
      "bottom" : "batch_normalization_19_output_intermin_",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1,
      "blob_weights_f16" : 147
    },
    {
      "bottom" : "activation_22_output,batch_normalization_19_output",
      "alpha" : 1,
      "operation" : 0,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "add_16",
      "top" : "add_16_output",
      "type" : "elementwise",
      "name" : "add_16",
      "beta" : 0
    },
    {
      "bottom" : "add_16_output",
      "weights" : {

      },
      "mode" : 0,
      "debug_info" : "activation_24",
      "top" : "activation_24_output",
      "type" : "activation",
      "name" : "activation_24"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "conv2d_8",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "conv2d_8_output",
      "K" : 8,
      "blob_biases" : 149,
      "name" : "conv2d_8",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 1,
      "bottom" : "activation_24_output",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1,
      "blob_weights_f16" : 151
    },
    {
      "bottom" : "conv2d_8_output",
      "weights" : {

      },
      "mode" : 3,
      "debug_info" : "output1",
      "top" : "output1",
      "type" : "activation",
      "name" : "output1",
      "attributes" : {
        "is_output" : 1
      }
    }
  ]
}